run/BM3/BM3_ConductionOnly/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0]; // kg m s K mol A cd

T_env   293; // ambient temperature (K)
T_vent  315; // eruption temperature (K)
fluidDensity 954;
Pr   34000;
cp    1500;

internalField   uniform $T_env; 

boundaryField
{

    lowerWall // EB: conductive heat exchange
    {
        type            exprMixed; 
        value           $internalField;
        variables       "Tinf=$T_env; rho=$fluidDensity; cp=$cp; DT=1/$Pr; k=DT*rho*cp; L_wall=0.002; k_wall=0.03";
        valueExpr       "Tinf";
        fractionExpr    "1.0/(1.0 + ( k/(mag(pos())) * (L_wall/k_wall) ))";
    }
    
    inletWall
    {
        type            fixedValue;
        value           uniform $T_vent;
	}	
    atmosphere
    {
       
        type            inletOutlet;
        inletValue      $internalField; 
        value           $internalField; 
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
